<h3>Pandas Refresher</h3>

In [3]:
import pandas as pd

<p>A simple pandas series</p>

In [4]:
import numpy as np

In [5]:
my_array = np.array([10, 20, 30, 40, 50])
my_series = pd.Series(my_array)
print(my_series)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [6]:
my_series = pd.Series(my_array, index=['num1', 'num2', 'num3', 'num4', 'num5'])
print(my_series)

num1    10
num2    20
num3    30
num4    40
num5    50
dtype: int32

In [7]:
my_series = pd.Series([10, 20, 30, 40, 50], index=['num1', 'num2', 'num3', 'num4', 'num5'])
print(my_series)

num1    10
num2    20
num3    30
num4    40
num5    50
dtype: int64

In [9]:
import pandas as pd
my_dict = {
    'num1': 6,
    'num2': 8,
    'num3': 10,
}

my_series = pd.Series(my_dict)

print(my_series)

num1     6
num2     8
num3    10
dtype: int64

In [13]:
my_series = pd.Series([10, 20, 30, 40, 50], index=['num1', 'num2', 'num3', 'num4', 'num5'])
my_series['num3']
my_series[0]

C:\Users\JohnWork\AppData\Local\Temp\ipykernel_13764\795427636.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  my_series[0]

10

In [15]:
my_series = pd.Series([5, 8, 2, 11, 9])
print(np.min(my_series))

2

In [16]:
print(np.max(my_series))

11

In [17]:
print(my_series.mean())

7.0

In [18]:
print(my_series.median())

8.0

In [19]:
print(my_series.dtype)

int64

In [20]:
print(my_series.to_list())

[5, 8, 2, 11, 9]

<p>Pandas Dataframes</p>

In [21]:
scores = [
    ['Mathematics', 85],
    ['English', 91],
    ['Science', 78],
    ['History', 82],
    ['Geography', 93],
    ['Physics', 87],
]

In [22]:
my_df = pd.DataFrame(scores, columns=['Subject', 'Score'])
my_df

       Subject  Score
0  Mathematics     85
1      English     91
2      Science     78
3      History     82
4    Geography     93
5      Physics     87

In [23]:
scores = {
    'Subject': ['Mathematics', 'History', 'English', 'Science', 'Arts'],
    'Score': [100, 90, 80, 70, 60]
}

In [24]:
my_df = pd.DataFrame(scores)
my_df

       Subject  Score
0  Mathematics    100
1      History     90
2      English     80
3      Science     70
4         Arts     60

In [25]:
scores = [
    {'Subject': 'Mathematics', 'Score': 85},
    {'Subject': 'History', 'Score': 98},
    {'Subject': 'English', 'Score': 76},
    {'Subject': 'Science', 'Score': 72},
    {'Subject': 'Arts', 'Score': 95},
]

In [26]:
my_df = pd.DataFrame(scores)
my_df

       Subject  Score
0  Mathematics     85
1      History     98
2      English     76
3      Science     72
4         Arts     95

In [27]:
scores = [
    {'Subject': 'Mathematics', 'Score': 85},
    {'Subject': 'History', 'Score': 98},
    {'Subject': 'English', 'Score': 76},
    {'Subject': 'Science', 'Score': 72},
    {'Score': 88},
    {'Subject': 'Arts', 'Score': 95},
]

In [28]:
my_df = pd.DataFrame(scores)
my_df

       Subject  Score
0  Mathematics     85
1      History     98
2      English     76
3      Science     72
4          NaN     88
5         Arts     95

In [32]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Subject  5 non-null      object
 1   Score    6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [33]:
my_df.describe()

           Score
count   6.000000
mean   85.666667
std    10.250203
min    72.000000
25%    78.250000
50%    86.500000
75%    93.250000
max    98.000000

<p>Importing CSV files</p>

In [34]:
import pandas as pd

In [35]:
titanic_data = pd.read_csv('./data_sets/iris_dataset.csv')
titanic_data.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa